app/controllers/trips_controller.rb

  def index
    @trips = Trip.where(user_email: current_user.email).reorder('id').reverse_order
    @trips_array = Array.new()
    api_key = ENV['GOOGLE_MAPS_WEB_SERVICES_KEY_UE']

    @trips.each do |eachTrip|
---
SELECT "trips".* FROM "trips" WHERE "trips"."user_email" = $1 ORDER BY id DESC  [["user_email", "xunzesu@gmail.com"]]
SELECT  "trips".* FROM "trips" ORDER BY "trips"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def show
    #----------------------------------------------------
    #
    # Find this trip based on id
    #
    #----------------------------------------------------
    @trip = Trip.find(params[:id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]

  def create
    @trip = Trip.new(trip_params)

    if @trip.save
---
INSERT INTO "trips" ("user_email", "created_at", "updated_at", "places", "start_end", "visit_order", "cost_time", "cost_dist", "cost_score", "green_score") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"